Логирование/src/Catalogs/лНастройкиЛогирования/лНастройкиЛогирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>лНастройкиЛогирования</name>
  <attributes>
    <name>УровеньЛогирования</name>
    <type>
      <types>EnumRef.лУровниЛогирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКаталогаЛоговНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКаталогаЛоговНаКлиенте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СпособыЛогирования</name>
    <attributes>
      <name>СпособЛогирования</name>
      <type>
        <types>EnumRef.лСпособыЛогирования</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонСообщения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФорматДаты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Логирование/src/Catalogs/лНастройкиЛогирования/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СпособыЛогированияШаблонСообщенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекШаблон = Элементы.СпособыЛогирования.ТекущиеДанные.ШаблонСообщения;
	ПараметрыФормы = Новый Структура("ТекШаблон", ТекШаблон);
	ОткрытьФорму("Справочник.лНастройкиЛогирования.Форма.КонструкторШаблонаИмениСобытия", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура СпособыЛогированияШаблонСообщенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	ТекДанные = Элементы.СпособыЛогирования.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		ТекДанные.ШаблонСообщения = ВыбранноеЗначение;
	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПутьКаталогаЛоговНаСервереНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Не ПустаяСтрока(Объект.ПутьКаталогаЛоговНаСервере) Тогда
		ДиалогВыбораПапки.Каталог = Объект.ПутьКаталогаЛоговНаСервере;
	КонецЕсли;
	ДиалогВыбораПапки.Показать(Новый ОписаниеОповещения("ПутьКаталогаЛоговНаСервереЗавершениеВыбора", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ПутьКаталогаЛоговНаСервереЗавершениеВыбора(Папка, ДополнительныеПараметры) Экспорт

	Если Папка <> Неопределено И Папка.Количество() > 0 Тогда
		Объект.ПутьКаталогаЛоговНаСервере = Папка[0];
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьКаталогаЛоговНаКлиентеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ДиалогВыбораПапки = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если Не ПустаяСтрока(Объект.ПутьКаталогаЛоговНаКлиенте) Тогда
		ДиалогВыбораПапки.Каталог = Объект.ПутьКаталогаЛоговНаКлиенте;
	КонецЕсли;
	ДиалогВыбораПапки.Показать(Новый ОписаниеОповещения("ПутьКаталогаЛоговНаКлиентеЗавершениеВыбора", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте
Процедура ПутьКаталогаЛоговНаКлиентеЗавершениеВыбора(Папка, ДополнительныеПараметры) Экспорт

	Если Папка <> Неопределено И Папка.Количество() > 0 Тогда
		Объект.ПутьКаталогаЛоговНаКлиенте = Папка[0];
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
